RIET/src/Catalogs/ERPTreatments/ERPTreatments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ERPTreatments</name>
  <predefined>
    <items>
      <name>Asset_FTE_Construction</name>
      <description>Производственные основные средства (строительство)</description>
    </items>
    <items>
      <name>Asset_NFTE_Construction</name>
      <description>Непроизводственные основные средства (строительство)</description>
    </items>
    <items>
      <name>Expense</name>
      <description>Материалы</description>
    </items>
    <items>
      <name>Issued_Inventory</name>
      <description>Используемый инвентарь</description>
    </items>
    <items>
      <name>New_Asset_FTE</name>
      <description>Новые производственные основные средства</description>
    </items>
    <items>
      <name>New_Asset_NFTE</name>
      <description>Новые непроизводственные основные средства</description>
    </items>
    <items>
      <name>New_Inventory</name>
      <description>Новый инвентарь</description>
    </items>
    <items>
      <name>Used_Asset</name>
      <description>Используемые основные средства</description>
    </items>
  </predefined>
</mdclass:Catalog>

RIET/src/Catalogs/ERPTreatments/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Тогда 
		СтандартнаяОбработка = Ложь;
		Поля.Добавить("Наименование");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Тогда 
		СтандартнаяОбработка = Ложь;
	  	Представление = Данные.Наименование;
	КонецЕсли;
	 	       
КонецПроцедуры

Функция ПолучитьTMSId(ERPTreatment) Экспорт
	
	ERPTreatments = Справочники.ERPTreatments;
	
	Если ERPTreatment = ERPTreatments.Expense Тогда
		Возврат "EXPENSE";
		
	ИначеЕсли ERPTreatment = ERPTreatments.Asset_FTE_Construction Тогда
		Возврат "ASSET CONSTRUCTION (FTE)";
		
	ИначеЕсли ERPTreatment =  ERPTreatments.Asset_NFTE_Construction Тогда
		Возврат "ASSET CONSTRUCTION (NFTE)";
		
	ИначеЕсли ERPTreatment = ERPTreatments.New_Inventory Тогда
		Возврат "NEW INVENTORY";
		
	ИначеЕсли ERPTreatment = ERPTreatments.Issued_Inventory Тогда
		Возврат "ISSUED INVENTORY";
		
	ИначеЕсли ERPTreatment = ERPTreatments.New_Asset_FTE Тогда
		Возврат "NEW ASSET (FTE)";
		
	ИначеЕсли ERPTreatment = ERPTreatments.New_Asset_NFTE Тогда
		Возврат "NEW ASSET (NFTE)";
						
	ИначеЕсли ERPTreatment = ERPTreatments.Used_Asset Тогда
		Возврат "USED ASSET";
		
	Иначе
		Возврат "EXPENSE";
		
	КонецЕсли;	
	
КонецФункции
